LPBF-application/0.orig/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions          [0 0 0 1 0 0 0];

    tAmb            298;
    tBase           473;

internalField       uniform $tAmb;

boundaryField
{
    outlet
    {
        type            zeroGradient;
    }

    inlet
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }

    solidBottom
    {
        type            fixedValue;
        value           uniform $tBase;
    }

    walls
    {
        type            zeroGradient;
    }
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
