LPBF-application/Allrun
#!/bin/sh
cd ${0%/*} || exit 1    # Run from this directory

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

cp -r 0.orig 0

runApplication blockMesh
runApplication decomposePar
runParallel topoSet
runParallel refineMesh -overwrite -dict system/refineMeshDict
runParallel setFields
runParallel renumberMesh -overwrite
runParallel $(getApplication)

#------------------------------------------------------------------------------
