LPBF-application/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale 0.001; //mm to m

vertices
(
    (-0.02 -0.02 -0.5)
    (2.02 -0.02 -0.5)
    (2.02 0.32 -0.5)
    (-0.02 0.32 -0.5)
    (-0.02 -0.02 0)
    (2.02 -0.02 0)
    (2.02 0.32 0)
    (-0.02 0.32 0)
    (-0.02 -0.02 0.2)
    (2.02 -0.02 0.2)
    (2.02 0.32 0.2)
    (-0.02 0.32 0.2)
    (-0.02 -0.02 0.4)
    (2.02 -0.02 0.4)
    (2.02 0.32 0.4)
    (-0.02 0.32 0.4)
    (-0.02 -0.02 0.2)
    (2.02 -0.02 0.2)
    (2.02 0.32 0.2)
    (-0.02 0.32 0.2)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (500 60 40) simpleGrading (1 1 0.3) // Bauplattform
    hex (4 5 6 7 8 9 10 11) (500 60 60) simpleGrading (1 1 1) // Pulverbett
    hex (16 17 18 19 12 13 14 15) (125 15 15) simpleGrading (1 1 1) //Gasstrom
);

edges
(
);

patches
(
    patch inlet
    (
        (16 17 13 12)
    )
    patch outlet
    (
        (19 15 14 18)
    )
    patch solidBottom //solidRegion
    (
        //(0 1 5 4)
        //(3 7 6 2)
        //(0 4 7 3)
        //(1 5 6 2)
        (0 3 2 1)
    )
    patch walls
    (
        (0 4 5 1)
        (3 7 6 2)
        (0 4 7 3)
        (1 2 6 5)
        (12 15 14 13)
        (4 8 11 7)
        (16 12 15 19)
        (6 10 9 5)
        (18 14 13 17)
        (4 5 9 8)
        (7 11 10 6)
    )
    patch internal1
    (
        (8 9 10 11)    
    )
    patch internal2
    (
        (16 19 18 17)
    )
);

mergePatchPairs
(
    (internal1 internal2)
);

// ************************************************************************* //
