LPBF-application/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue alpha.gas 1
    volScalarFieldValue alpha.liquid 0
    volScalarFieldValue alpha.solid 0
);

regions
(

    surfaceToCell
    {
        file "./STL/powder.stl";
        fileType stl;
        scale 0.001;
        nearDistance -1;
        curvature -100;
        outsidePoints (
        (0.001 0 -0.00005)
        (0.001 0 0.0003)
        );
        includeInside true;
        includeOutside false;
        includeCut true;
        fieldValues
        (
        volScalarFieldValue alpha.solid 1
        volScalarFieldValue alpha.gas 0
        );
    }
   
    boxToCell
    {
        box (-0.00002 -0.00002 -0.0005) (0.00202 0.00032 0);
        fieldValues
        (
        volScalarFieldValue alpha.solid 1
        volScalarFieldValue alpha.gas 0
        volScalarFieldValue T 498
        ); 
    }
   
    /*boxToCell
    {
        box (0 0 0.0002) (0.002 0.0003 0.0004);
        fieldValues
        (
        volVectorFieldValue U (0 3 0)
        ); 
    }*/

);


// ************************************************************************* //
