LPBF-application/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      topoSetDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    /* If AMR is used, we don't want to refine manually
    {
        name    melt;
        type    cellSet;
        action  new;
        source  boxToCell;
        sourceInfo
        {
        box ( 0.0001 0.0001 -0.0001 ) ( 0.0002 0.0002 0.0002 );
        }
    }
    */
);

// ************************************************************************* //